vault backup: 2026-07-22 02:59:58: fixed diagram
